[
  {
    "e_name": "atomic tricep blasters",
    "e_level": 5,
    "e_body_split": 2,
    "e_youtube_id": "5XSiNXX8vOw",
    "e_description": {
      "about": "This is an advanced triceps-focused push-up variation designed to maximize muscular activation through explosive, grounded movements. As you perform each rep, your body pushes off slightly from the floor—engaging both tricep fibers for strength and muscular endurance. It's particularly effective for building definition and tone in the triceps while also recruiting the chest and core stabilizers.",
      "instructions": [
        "Begin in a standard push-up position, hands shoulder-width apart.",
        "Lower your chest toward the floor.",
        "As you explode upward, push off the ground slightly so your hands come up just a bit.",
        "Land softly back into the starting push-up position.",
        "Repeat each rep with controlled form and explosive intent."
      ]
    }
  },
  {
    "e_name": "behind the neck pull-ups",
    "e_level": 4,
    "e_body_split": 2,
    "e_youtube_id": "oAu-Xc-OKxo",
    "e_description": {
      "about": "Behind-the-neck pull-ups are an advanced variation of the classic pull-up where you lift your body until the back of your neck nears or touches the bar. This targets the upper back, rear delts, lats, and traps more intensely than standard pull-ups. Due to the increased shoulder rotation, they require excellent mobility and control to perform safely.",
      "instructions": [
        "Grab the bar with an overhand grip slightly wider than shoulder-width and hang fully extended.",
        "Engage your shoulder blades by pulling them down and back.",
        "Begin pulling your body upward, aiming to bring the back of your neck toward the bar.",
        "Keep your torso upright and avoid swinging or jerking the movement.",
        "Stop once the bar is behind your head and level with your upper traps or just above.",
        "Lower yourself slowly and with control back to the starting position.",
        "Repeat for the desired number of reps, focusing on strict form."
      ]
    }
  },
  {
    "e_name": "bicycle crunches",
    "e_level": 2,
    "e_body_split": 4,
    "e_youtube_id": "jixPu5GPhic",
    "e_description": {
      "about": "An incredibly efficient core exercise that engages the rectus abdominis, transverse abdominis, and external obliques all at once. Bicycle crunches strengthen the entire abdominal wall while improving coordination and oblique definition.",
      "instructions": [
        "Lie on your back with knees bent at 90°, feet lifted slightly off the floor.",
        "Place fingertips lightly behind your head with elbows wide to avoid neck strain.",
        "Lift your shoulder blades off the floor and maintain a neutral chin position.",
        "Extend your left leg straight while twisting your torso to bring your right elbow toward your left knee.",
        "Switch sides by extending the right leg and twisting the torso to bring your left elbow to your right knee.",
        "Continue alternating sides in a controlled, cycling motion—focus on slow, deliberate movement and full range of motion.",
        "Inhale as you prepare, exhale as you crunch and twist—maintain consistent tempo for better muscle activation."
      ]
    }
  },
  {
    "e_name": "box squats",
    "e_level": 2,
    "e_body_split": 3,
    "e_youtube_id": "1K5DreFND0M",
    "e_description": {
      "about": "Box squats are a squat variation where you descend and lightly sit on a box or bench before standing back up. This technique helps reinforce proper depth, improve form, and activate the posterior chain (glutes, hamstrings, lower back) more effectively than traditional squats. It's especially beneficial for building explosive strength, managing knee strain, and enforcing consistency in squat depth.",
      "instructions": [
        "Stand in front of a sturdy box or bench with your feet hip-width apart.",
        "Brace your core, push your hips back, and lower down until your glutes touch the box gently.",
        "Pause briefly without relaxing—maintain tension in core and legs.",
        "Drive through your heels and glutes to stand back up with control.",
        "Repeat for the desired number of reps, focusing on consistent depth and explosive drive."
      ]
    }
  },
  {
    "e_name": "burpee muscle-ups",
    "e_level": 6,
    "e_body_split": 1,
    "e_youtube_id": "BK0MNOfDal4",
    "e_description": {
      "about": "A hybrid full-body movement that fuses burpees and muscle-ups into one explosive sequence. This advanced exercise develops upper-body pulling strength, core stability, and powerful leg drive—all while pushing your cardiovascular limits.",
      "instructions": [
        "Stand with feet shoulder-width apart, then drop into a low squat and plant your hands on the floor.",
        "Kick your feet back into a high plank position.",
        "Perform a push-up, then explosively pull your torso upward into a muscle-up—and transition smoothly to dip above the bar or elevated surface.",
        "Land softly, immediately drive your legs back into a squat, and explode upward into a vertical jump.",
        "Reset and repeat with controlled form—brace your core throughout and engage lats and triceps during the muscle-up phase."
      ]
    }
  },
  {
    "e_name": "burpee pull-ups",
    "e_level": 5,
    "e_body_split": 1,
    "e_youtube_id": "7H7t_idCDK8",
    "e_description": {
      "about": "Burpee pull-ups are a high-intensity, full-body exercise that combines the explosive movement of a burpee with the upper-body strength challenge of a pull-up. This exercise targets multiple muscle groups, including the chest, shoulders, arms, back, core, and legs, while also providing a cardiovascular workout. It's commonly used in CrossFit and functional training routines to build strength, endurance, and agility.",
      "instructions": [
        "Stand with your feet shoulder-width apart, facing a pull-up bar.",
        "Perform a standard burpee by dropping into a squat, placing your hands on the floor, jumping your feet back into a plank position, completing a push-up, then jumping your feet forward and exploding upward into a jump.",
        "At the peak of your jump, grab the pull-up bar with an overhand grip and perform a pull-up.",
        "Lower yourself back down, release the bar, and descend to the ground to reset.",
        "Repeat the sequence for the desired number of repetitions, focusing on smooth transitions and controlled movements."
      ]
    }
  },
  {
    "e_name": "burpee tuck jumps",
    "e_level": 5,
    "e_body_split": 1,
    "e_youtube_id": "MCmLRa6ZDfA",
    "e_description": {
      "about": "A powerful, full-body plyometric move that combines a traditional burpee with a tuck jump. It builds explosive strength in the legs and glutes, elevates heart rate for cardio conditioning, and improves overall agility and coordination.",
      "instructions": [
        "Start standing with feet shoulder-width apart.",
        "Drop into a squat and place your hands on the floor.",
        "Kick your feet back into a plank and optionally add a push-up.",
        "Immediately return your feet to squat position.",
        "Explosively jump up, bringing knees toward your chest (tuck jump).",
        "Land softly and repeat, maintaining core tension throughout."
      ]
    }
  },
  {
    "e_name": "burpees",
    "e_level": 4,
    "e_body_split": 1,
    "e_youtube_id": "1uVMRGEl4y4",
    "e_description": {
      "about": "Burpees are a high-intensity, full-body exercise that combines a squat, plank, push-up, and jump in one fluid motion. They activate your legs, chest, shoulders, core, and glutes, improving strength, endurance, and cardiovascular fitness.",
      "instructions": [
        "Stand with feet shoulder-width apart, chest up and shoulders back.",
        "Lower into a squat and place hands firmly on the ground shoulder-width apart.",
        "Kick your feet back quickly into a straight-body plank position.",
        "Lower your chest to the floor with a push-up, then press back up.",
        "Jump your feet toward your hands, landing softly in a squat.",
        "Explode up into a vertical jump, reaching arms overhead.",
        "Land softly and immediately go into the next rep in one continuous sequence."
      ]
    }
  },
  {
    "e_name": "calf jumps",
    "e_level": 1,
    "e_body_split": 3,
    "e_youtube_id": "JUtwYOZQ9ms",
    "e_description": {
      "about": "Calf jumps are a plyometric lower-body exercise that powerfully targets the gastrocnemius and soleus muscles. They develop ankle stiffness, reactive strength, and explosive power for better performance in sprinting and jumping.",
      "instructions": [
        "Stand with your feet approximately hip-width apart and knees slightly bent.",
        "Keep your core engaged and maintain soft knees throughout.",
        "Push off through the balls of your feet and quickly jump straight up using calf contraction.",
        "Land softly on the balls of your feet, absorbing impact with your knees slightly bent.",
        "Perform repetitions in a controlled rhythm—reset briefly between jumps."
      ]
    }
  },
  {
    "e_name": "calf raises",
    "e_level": 1,
    "e_body_split": 3,
    "e_youtube_id": "f8wHShJMSmw",
    "e_description": {
      "about": "Calf raises are a foundational lower-body exercise that isolate and strengthen the gastrocnemius and soleus muscles, improving ankle stability, posture, and lower-leg endurance.",
      "instructions": [
        "Stand upright with feet about hip-width apart, heels hanging off the edge of a raised platform or step if available.",
        "Shift your weight onto the balls of your feet and lift your heels as high as possible by contracting your calves.",
        "Pause briefly at the top to feel the full muscle contraction.",
        "Lower your heels in a slow, controlled manner until you feel a stretch in your calf muscles.",
        "Repeat for the desired number of reps, maintaining good posture and steady breathing."
      ]
    }
  },
  {
    "e_name": "chest-ups",
    "e_level": 3,
    "e_body_split": 4,
    "e_youtube_id": "d7pLCFa-omY",
    "e_description": {
      "about": "A dynamic sit-up variation where you finish with a deliberate chest lift. Targets the rectus abdominis and builds spinal control and posture.",
      "instructions": [
        "Lie on your back with knees bent and feet flat on the floor.",
        "Cross your arms over your chest (or lightly place fingers behind your ears without pulling).",
        "Engage your core, exhale and lift your torso upward by flexing at the hips and waist.",
        "As you reach upright, arch your upper spine to lift your chest toward the ceiling while keeping your lower back neutral.",
        "Pause briefly at the top in full tension.",
        "Slowly lower your torso vertebra by vertebra back to the starting position.",
        "Repeat for the desired number of reps with controlled form."
      ]
    }
  },
  {
    "e_name": "chin-ups",
    "e_level": 4,
    "e_body_split": 2,  
    "e_youtube_id": "alLrecBkCvU",
    "e_description": {
      "about": "Chin-ups are a challenging upper-body exercise that focus on the lats, biceps, forearms, and rear shoulders. Using an underhand (supinated) grip, palms facing you, they build strength in the back and arms while improving core control and posture.",
      "instructions": [
        "Reach up and grip the bar slightly narrower than shoulder-width, palms facing you.",
        "Hang with arms fully extended, core engaged and legs together.",
        "Initiate by pulling the shoulder blades down and back.",
        "Pull your body upward, keeping elbows close, until your chin clears the bar.",
        "Pause briefly at the top, then slowly lower with control back to a full hang.",
        "Use band assistance or negatives if you can't yet complete full reps with proper form."
      ]
    }
  },
  {
    "e_name": "clapping pull-ups",
    "e_level": 6,
    "e_body_split": 2,
    "e_youtube_id": "GZRj5HJqK-I",
    "e_description": {
      "about": "An explosive upper-body power movement. The pull-up is performed with enough force to let go of the bar, clap in mid-air, and catch the bar again. Excellent for building grip strength, back and shoulder power, and coordination.",
      "instructions": [
        "Hang from a pull-up bar with a shoulder-width overhand grip, arms fully extended.",
        "Engage your scapulas and pull explosively upward so your chin clears the bar.",
        "At the top, loosen your grip enough to clap your hands quickly in front of your chest.",
        "Re-grip the bar securely and control your descent back to a dead hang.",
        "Repeat for the prescribed number of reps, maintaining strict form and timing."
      ]
    }
  },
  {
    "e_name": "clapping push-ups",
    "e_level": 5,
    "e_body_split": 1,
    "e_youtube_id": "mj25D73_TmA",
    "e_description": {
      "about": "Clapping push-ups are an advanced plyometric variation of the standard push-up, designed to enhance explosive upper-body power. By pushing off the ground with sufficient force to clap your hands mid-air, this exercise targets the chest, shoulders, and triceps, while also engaging the core for stability.",
      "instructions": [
        "Begin in a high plank position with your hands slightly wider than shoulder-width apart and your body forming a straight line from head to heels.",
        "Lower your body towards the ground by bending your elbows, keeping your core tight and back straight.",
        "Explosively push yourself off the ground, generating enough force to lift your hands into the air.",
        "While in mid-air, quickly clap your hands together before returning them to the push-up position.",
        "Land softly with your hands back in the starting position and immediately lower your body into the next repetition."
      ]
    }
  },
  {
    "e_name": "commando pull-ups",
    "e_level": 4,
    "e_body_split": 2,
    "e_youtube_id": "ncg7iWv4VFY",
    "e_description": {
      "about": "Commando pull-ups, also known as Tarzan pull-ups, are an advanced upper-body exercise that targets the lats, biceps, forearms, and core. Unlike standard pull-ups, they involve a neutral grip with palms facing each other and require lateral movement, engaging stabilizing muscles and enhancing grip strength.",
      "instructions": [
        "Stand perpendicular to the pull-up bar with feet shoulder-width apart.",
        "Reach up and grasp the bar with a neutral grip (palms facing each other), hands close together.",
        "Hang with arms fully extended, engaging your core and maintaining a straight body.",
        "Pull yourself up towards one side of the bar, aiming to bring your shoulder toward the bar.",
        "At the top of the movement, your chin should clear the bar, and your body should remain stable without swinging.",
        "Lower yourself back down in a controlled manner to the starting position.",
        "Alternate sides with each repetition to ensure balanced muscle development."
      ]
    }
  },
  {
    "e_name": "criss cross scissors",
    "e_level": 1,
    "e_body_split": 1,
    "e_youtube_id": "34dA6YPwjEQ",
    "e_description": {
      "about": "Criss-cross scissors are a beginner-friendly core exercise that targets the lower abs and hip flexors. This movement involves alternating leg kicks in a scissor-like fashion while maintaining a stable upper body, promoting core engagement and improving lower body coordination.",
      "instructions": [
        "Lie flat on your back with your legs extended and arms by your sides or under your glutes for support.",
        "Lift your legs about 6 inches off the ground, keeping them straight and together.",
        "Alternate crossing one leg over the other in a scissor motion, ensuring your core remains engaged and your lower back stays pressed into the floor.",
        "Continue the alternating leg movement for the desired duration or number of repetitions, maintaining controlled breathing and posture."
      ]
    }
  },
  {
    "e_name": "crunch kicks",
    "e_level": 1,
    "e_body_split": 4,
    "e_youtube_id": "2WtR_OdkSV8",
    "e_description": {
      "about": "Crunch Kicks are a dynamic core-focused exercise that target the lower abs and hip flexors. They help strengthen abdominal control, improve flexibility and engage the entire core without equipment.",
      "instructions": [
        "Lie on your back with your arms alongside your body and palms on the floor.",
        "Lift your shoulders slightly off the floor, keeping your lower back pressed down.",
        "Raise your knees toward your chest, then extend both legs straight out in front.",
        "Pull your knees back in toward your chest to complete one rep.",
        "Repeat slowly and with control — aim for 10-12 reps per set.",
        "Maintain steady breathing: exhale during the kick-out, inhale when your legs return."
      ]
    }
  },
  {
    "e_name": "crunches",
    "e_level": 1,
    "e_body_split": 4,
    "e_youtube_id": "mrWTxAXr3LA",
    "e_description": {
      "about": "Crunches are a classic core exercise that isolate the upper abdominal muscles (rectus abdominis and obliques). They're effective for building tone and strength without involving the hip flexors or placing strain on the lower back when done with proper form.",
      "instructions": [
        "Lie flat on your back with knees bent and feet flat on the floor.",
        "Place your hands at your temples or light on your chest—avoid pulling on your neck.",
        "Engage your core by gently tucking your chin and lifting your shoulders and upper back just a few inches off the mat.",
        "Pause briefly at the top while squeezing the abs, then slowly lower back down with control.",
        "Repeat for the desired number of reps, focusing on quality over quantity."
      ]
    }
  },
  {
    "e_name": "decline push-ups",
    "e_level": 3,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Decline push-ups are an advanced variation of the standard push-up that place greater emphasis on the upper chest (clavicular head of the pectorals), front deltoids, and triceps. Elevating the feet shifts more body weight onto the arms and increases difficulty, making them ideal for building upper-body strength and definition.",
      "instructions": [
        "Start in a push-up position with your feet elevated on a stable surface like a bench or step.",
        "Place your hands shoulder-width apart on the floor and engage your core to keep your body in a straight line.",
        "Lower your chest toward the ground by bending your elbows, keeping them at about a 45-degree angle.",
        "Pause briefly when your chest is just above the floor.",
        "Push through your palms to return to the starting position, maintaining a rigid body line throughout.",
        "Repeat for the desired number of reps."
      ]
    }
  },
  {
    "e_name": "dips",
    "e_level": 4,
    "e_body_split": 2,
    "e_youtube_id": "4EttxHPj1dQ",
    "e_description": {
      "about": "Dips are a powerful compound upper-body movement primarily targeting the chest, triceps, and front shoulders. Performed using parallel bars, they also engage the core as you stabilize your body throughout the full range of motion.",
      "instructions": [
        "Grip the parallel bars firmly and lift yourself into the top position with arms straight.",
        "Lean your torso slightly forward and brace your core.",
        "Lower yourself with control until your shoulders are parallel or just below your elbows.",
        "Pause momentarily at the bottom, then push back up to near full arm extension—avoid locking out fully.",
        "Maintain tension by keeping elbows close to your sides and shoulders pulled down."
      ]
    }
  },
  {
    "e_name": "forward backward hops",
    "e_level": 1,
    "e_body_split": 1,
    "e_youtube_id": "GPlp3d2F4H8",
    "e_description": {
      "about": "Forward-backward hops are a low-impact plyometric movement ideal for building leg power, coordination, and balance. This exercise engages the quads, calves, and glutes while helping improve footwork and agility.",
      "instructions": [
        "Stand with feet hip-width apart, soft knees, and core engaged.",
        "Bend slightly into a mini squat, then hop forward ~6-10 inches, landing softly on both feet.",
        "Immediately hop backward to return to starting position in a controlled manner.",
        "Continue this forward-backward rhythm for the desired number of reps or time, keeping movement steady.",
        "Focus on light, cushioned landings and controlled balance between hops."
      ]
    }
  },
  {
    "e_name": "four square hops",
    "e_level": 1,
    "e_body_split": 3,
    "e_youtube_id": "Odx8QeE634I",
    "e_description": {
      "about": "Four-square hops are a dynamic plyometric exercise performed in a marked or imagined square. This cardio-boosting movement enhances lower-body strength, agility, balance and coordination by jumping between quadrants rapidly.",
      "instructions": [
        "Visualize or mark a square on the floor divided into four equal quadrants.",
        "Stand with feet together in one corner",
        "Explosively hop (double-leg) to the adjacent quadrant in a clockwise or counter-clockwise direction",
        "Land softly on the balls of your feet with knees slightly bent",
        "Immediately hop to the next corner, repeating the sequence continuously",
        "Maintain rhythm and use your arms to help with balance and movement control"
      ]
    }
  },
  {
    "e_name": "front lever swings",
    "e_level": 6,
    "e_body_split": 1,
    "e_youtube_id": "ek4YOOlVamk",
    "e_description": {
      "about": "Front lever swings (also known as front lever raises) are an advanced calisthenics movement that target core, back, shoulders, and grip strength. Executed from a hanging position, you raise your entire body horizontally until parallel to the ground, engage your core, lats, and glutes, then lower down under control.",
      "instructions": [
        "Grab a pull-up bar with an overhand grip about shoulder-width apart.",
        "Start from a full dead hang with arms straight and core braced.",
        "Tighten glutes, lats, and abs to keep your body rigid in a straight line.",
        "Engage your upper body to pull and lift your legs and torso until parallel to the ground.",
        "Hold the horizontal position briefly (0.5-1 second) with full body tension.",
        "Slowly lower back down to a dead hang maintaining control.",
        "Repeat for prescribed reps ensuring form is consistent."
      ]
    }
  },
  {
    "e_name": "full-body crunches",
    "e_level": 3,
    "e_body_split": 4,
    "e_youtube_id": "Jd2zRTtGNCk",
    "e_description": {
      "about": "A dynamic ab exercise that brings both your upper body and hips together in one fluid motion. Full-body crunches target the rectus abdominis, hip flexors, and engage the obliques while requiring core stability throughout.",
      "instructions": [
        "Lie flat on your back on a mat with legs extended and arms overhead.",
        "Engage your core and exhale as you simultaneously crunch up your shoulders and tuck your knees toward your chest.",
        "Move your arms forward so hands reach past your knees, keeping movement controlled from the abs.",
        "Inhale and slowly extend your legs out straight and lower your upper body back toward the mat.",
        "Maintain control—don't use momentum or swing your limbs during the exercise.",
        "Repeat for desired reps, using a slow tempo to maximize core engagement."
      ]
    }
  },
  {
    "e_name": "half-wipers",
    "e_level": 3,
    "e_body_split": 4,
    "e_youtube_id": "9cwskL0_-9Q",
    "e_description": {
      "about": "Half-Wipers are a lying core exercise (a simplified Windshield Wiper) that targets the obliques, lower abs, hip flexors and helps improve core strength and control while reducing reliance on momentum.",
      "instructions": [
        "Lie on your back with arms extended to the sides for support.",
        "Raise both knees to tabletop (90°) and keep them together.",
        "Engage your abs and slowly lower both legs to one side without touching the floor.",
        "Pause briefly, then use your core to lift your legs back to center.",
        "Repeat the motion to the opposite side in a controlled manner.",
        "Continue alternating sides for the desired number of reps."
      ]
    }
  },
  {
    "e_name": "handstand push-ups",
    "e_level": 6,
    "e_body_split": 2,
    "e_youtube_id": "UdUT9SZIgB0",
    "e_description": {
      "about": "Handstand Push-Ups (HSPUs) are an advanced bodyweight pressing movement performed in a vertical (inverted) position. They develop major upper-body strength—especially in the shoulders, triceps, upper chest—and require strong core stability and balance control for safe execution.",
      "instructions": [
        "Kick or walk your feet up a wall until your torso is vertical and stable.",
        "Align shoulders directly over wrists, bracing core and glutes.",
        "Lower your head carefully toward the floor, keeping your elbows tucked slightly in.",
        "Pause gently at the bottom once your head approaches your hands.",
        "Press back up through shoulders and triceps until arms are fully extended.",
        "Maintain control on the descent and ascent, avoiding arching the lower back."
      ]
    }
  },
  {
    "e_name": "hanging criss cross scissors",
    "e_level": 4,
    "e_body_split": 4,
    "e_youtube_id": "2qM8IDT2e1Q",
    "e_description": {
      "about": "Hanging Criss-Cross Scissors are an advanced core exercise performed from a dead hang on a pull-up bar. This dynamic movement targets the obliques, hip flexors, and lower abs, enhancing rotational strength and stability. The exercise also engages the upper body for grip and shoulder stability.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and legs straight.",
        "Engage your core and raise your legs to a 45-degree angle.",
        "Cross your legs over each other in a scissor motion, alternating which leg is on top.",
        "Continue the criss-cross motion in a controlled manner, focusing on engaging the obliques and maintaining stability.",
        "Perform the exercise for the desired number of repetitions or time, ensuring controlled movements throughout."
      ]
    }
  },
  {
    "e_name": "hanging hurdles",
    "e_level": 3,
    "e_body_split": 4,
    "e_youtube_id": "EJKnEMur0OA",
    "e_description": {
      "about": "Hanging Hurdles are an intermediate-level core exercise performed from a dead hang on a pull-up bar. This dynamic movement targets the obliques, hip flexors, and lower abs, enhancing rotational strength and stability. The exercise also engages the upper body for grip and shoulder stability.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and legs straight.",
        "Engage your core and raise your legs to a 45-degree angle.",
        "Twist your hips to one side, bringing your legs across your body in a controlled motion.",
        "Return to the center and repeat the movement to the other side.",
        "Continue alternating sides for the desired number of repetitions or time, ensuring controlled movements throughout."
      ]
    }
  },
  {
    "e_name": "hanging knee raises",
    "e_level": 3,
    "e_body_split": 4,
    "e_youtube_id": "ogGX5PJ1gY8",
    "e_description": {
      "about": "Hanging Knee Raises are an effective core exercise performed by hanging from a pull-up bar and lifting your knees toward your chest. This movement primarily targets the lower abdominals and hip flexors, while also engaging the forearms and shoulders for grip and stability.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and feet off the ground.",
        "Engage your core and raise your knees toward your chest in a controlled manner.",
        "Avoid swinging your body; focus on using your abdominal muscles to lift your legs.",
        "Pause briefly at the top of the movement, then slowly lower your legs back to the starting position.",
        "Repeat for the desired number of repetitions, maintaining control throughout the exercise."
      ]
    }
  },
  {
    "e_name": "hanging leg raises",
    "e_level": 4,
    "e_body_split": 4,
    "e_youtube_id": "p2frQGA7xaQ",
    "e_description": {
      "about": "Hanging Leg Raises are an advanced core exercise performed by hanging from a pull-up bar and lifting your legs toward your chest or higher. This movement primarily targets the lower abdominals and hip flexors, while also engaging the forearms and shoulders for grip and stability.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and feet off the ground.",
        "Engage your core and raise your legs toward your chest in a controlled manner.",
        "Avoid swinging your body; focus on using your abdominal muscles to lift your legs.",
        "Pause briefly at the top of the movement, then slowly lower your legs back to the starting position.",
        "Repeat for the desired number of repetitions, maintaining control throughout the exercise."
      ]
    }
  },
  {
    "e_name": "hanging leg rotations",
    "e_level": 4,
    "e_body_split": 4,
    "e_youtube_id": "rDtBVY3DBNg",
    "e_description": {
      "about": "Hanging Leg Rotations are an advanced core exercise performed by hanging from a pull-up bar and rotating the legs in a controlled manner. This movement primarily targets the obliques, hip flexors, and lower abs, while also engaging the forearms and shoulders for grip and stability.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and feet off the ground.",
        "Engage your core and raise your legs to a 45-degree angle.",
        "Rotate your legs to one side, bringing them across your body in a controlled motion.",
        "Return to the center and repeat the movement to the other side.",
        "Continue alternating sides for the desired number of repetitions or time, ensuring controlled movements throughout."
      ]
    }
  },
  {
    "e_name": "hanging oblique raises",
    "e_level": 3,
    "e_body_split": 4,
    "e_youtube_id": "JIfaAlksmTQ",
    "e_description": {
      "about": "Hanging Oblique Raises are an intermediate-level core exercise performed by hanging from a pull-up bar and lifting your knees toward your armpit on one side. This movement primarily targets the obliques, with secondary engagement of the hip flexors and lower abs, while also requiring grip and shoulder stability.",
      "instructions": [
        "Hang from a pull-up bar with an overhand grip, arms fully extended and feet off the ground.",
        "Engage your core and raise your knees toward your chest.",
        "Twist your torso to one side, bringing your knees toward your armpit on that side.",
        "Pause briefly at the top of the movement, then slowly lower your legs back to the starting position.",
        "Repeat the movement on the other side, alternating sides for the desired number of repetitions."
      ]
    }
  },
  {
    "e_name": "hanging open close scissors",
    "e_level": 4,
    "e_body_split": 4,
    "e_youtube_id": "T3dJdB3exHI",
    "e_description": {
      "about": "Hanging Open-Close Scissors are an advanced core exercise performed by hanging from a pull-up bar and alternating leg movements in a scissor-like pattern. This dynamic movement targets the lower abdominals, hip flexors, and obliques, while also engaging the forearms and shoulders for grip and stability.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and feet off the ground.",
        "Engage your core and raise your legs to a 45-degree angle.",
        "Open your legs wide apart, then quickly close them back together.",
        "Alternate the opening and closing of your legs in a controlled manner, focusing on engaging your core muscles.",
        "Continue the movement for the desired number of repetitions, maintaining control and avoiding swinging."
      ]
    }
  },
  {
    "e_name": "hanging shoot-ups",
    "e_level": 6,
    "e_body_split": 4,
    "e_youtube_id": "",
    "e_description": {
      "about": "Hanging Shoot-Ups are an advanced calisthenics exercise performed from a dead hang on a pull-up bar. This dynamic movement targets the core, shoulders, and hip flexors, enhancing explosive strength, coordination, and body control.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and legs straight.",
        "Engage your core and raise your legs to a 45-degree angle.",
        "In a controlled motion, shoot your legs upward and forward, aiming to bring your knees toward your chest.",
        "Quickly reverse the movement, shooting your legs downward and backward, extending them fully.",
        "Repeat the movement for the desired number of repetitions, maintaining control and avoiding swinging."
      ]
    }
  },
  {
    "e_name": "hanging up down scissors",
    "e_level": 4,
    "e_body_split": 4,
    "e_youtube_id": "vQEneqVKCcc",
    "e_description": {
      "about": "Hanging Up-Down Scissors are an advanced core exercise performed by hanging from a pull-up bar and alternating leg movements in a scissor-like pattern. This dynamic movement targets the lower abdominals, hip flexors, and obliques, while also engaging the forearms and shoulders for grip and stability.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and feet off the ground.",
        "Engage your core and raise your legs to a 45-degree angle.",
        "Open your legs wide apart, then quickly close them back together.",
        "Alternate the opening and closing of your legs in a controlled manner, focusing on engaging your core muscles.",
        "Continue the movement for the desired number of repetitions, maintaining control and avoiding swinging."
      ]
    }
  },
  {
    "e_name": "hanging wipers",
    "e_level": 6,
    "e_body_split": 4,
    "e_youtube_id": "",
    "e_description": {
      "about": "Hanging Windshield Wipers are an advanced core exercise performed by hanging from a pull-up bar and rotating the legs from side to side in a wide arc, resembling a windshield wiper. This dynamic movement targets the obliques, abs, and hip flexors, while also engaging the forearms and shoulders for grip and stability.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, arms fully extended and feet off the ground.",
        "Engage your core and raise your legs to a 45-degree angle.",
        "Rotate your legs to one side, bringing them across your body in a controlled motion.",
        "Return to the center and repeat the movement to the other side.",
        "Continue alternating sides for the desired number of repetitions or time, ensuring controlled movements throughout."
      ]
    }
  },
  {
    "e_name": "heiden hops",
    "e_level": 2,
    "e_body_split": 3,
    "e_youtube_id": "N0UVekBvpWA",
    "e_description": {
      "about": "Heiden hops (also known as lateral Heiden hops) are explosive lateral jumps performed from one leg to the other. They build plyometric power, lateral drive, and ankle stability, training the posterior chain and hip stabilizers with each landing.",
      "instructions": [
        "Stand on one leg with a slight knee bend",
        "Push off laterally and hop to the opposite leg",
        "Land softly with bent knee and control the landing",
        "Immediately hop back to the starting leg, maintaining rhythm",
        "Keep core tight and land quietly to absorb impact"
      ]
    }
  },
  {
    "e_name": "high knees",
    "e_level": 1,
    "e_body_split": 3,
    "e_youtube_id": "XSGZon-Owjw",
    "e_description": {
      "about": "High knees are a cardio-intensive drill that boosts heart rate and improves stamina. They engage the hip flexors, quads, calves, glutes, and core, making it a full-lower-body activation movement. Great as part of warm-ups or high-intensity circuits.",
      "instructions": [
        "Stand tall with your feet hip-width apart.",
        "Drive one knee up toward waist or higher, while swinging the opposite arm forward.",
        "Quickly alternate knees at a steady rhythm—think jog in place, lifting knees high.",
        "Land lightly on the balls of your feet and maintain an upright posture.",
        "Continue for the desired duration, focusing on form and consistent tempo."
      ]
    }
  },
  {
    "e_name": "incline push-ups",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "Ab2usUky0WA",
    "e_description": {
      "about": "Incline push-ups are a beginner-friendly variation of the standard push-up. Placing your hands on an elevated surface reduces the load while still engaging the upper chest, triceps, and shoulders. This variation helps build strength and proper form with less strain on the wrists and core.",
      "instructions": [
        "Place your hands shoulder-width apart on a bench, box, or chair that is stable and elevated.",
        "Extend your legs straight behind you so your body forms a straight line from shoulders to heels.",
        "Keep your core tight and maintain a neutral spine throughout.",
        "Slowly bend your elbows to lower your chest toward the bench until it's just above it.",
        "Pause briefly at the bottom, then press through your palms to straighten your arms and return to starting position.",
        "Repeat for the desired number of repetitions, focusing on controlled tempo (e.g. 3-second descent, 1-second press) :contentReference[oaicite:1]{index=1}"
      ]
    }
  },
  {
    "e_name": "inverted rows",
    "e_level": 3,
    "e_body_split": 2,
    "e_youtube_id": "B7XDCe5ayA8",
    "e_description": {
      "about": "The inverted row is a bodyweight pulling exercise that targets the muscles of the upper back—especially the lats, rhomboids, and traps—while also engaging the biceps and core. It's an excellent progression for building upper-body pulling strength and improving pull-up ability.",
      "instructions": [
        "Find a sturdy bar (or use a Smith-machine or suspension trainer) set at around hip to chest height.",
        "Lie underneath it and grab the bar with an overhand grip, hands slightly wider than shoulder-width.",
        "Extend your body so your heels touch the ground and your body forms a straight line from shoulders to feet.",
        "Engage your core and glutes to keep hips lifted and spine neutral.",
        "Pull your chest up toward the bar by retracting your shoulder blades and bending your elbows.",
        "Lower yourself back down under control until your arms are fully extended.",
        "Repeat for desired reps (typically 8-12), maintaining tension and control on both concentric and eccentric phases."
      ]
    }
  },
  {
    "e_name": "jumping chin-ups",
    "e_level": 3,
    "e_body_split": 2,
    "e_youtube_id": "gXsTuiUer48",
    "e_description": {
      "about": "Jumping chin-ups bridge the gap between assisted and full chin-ups by using momentum off the ground. They target the lats, biceps, upper back, and grip strength, while helping build strength for full chin-ups.",
      "instructions": [
        "Stand directly under a chin-up bar and grab it using an underhand (chin-up) grip, hands shoulder-width apart.",
        "Bend your knees slightly and jump upward to help pull your chin above the bar.",
        "Use the upward momentum to assist but avoid fully relying on it—engage your lats and biceps to complete the pull.",
        "Lower yourself slowly back to a dead hang with arms fully extended before the next rep.",
        "Focus on controlled negatives to build strength if full pull-ups are not yet possible."
      ]
    }
  },
  {
    "e_name": "jumping jacks",
    "e_level": 1,
    "e_body_split": 1,
    "e_youtube_id": "e02t73peL8c",
    "e_description": {
      "about": "Jumping jacks are a classic full-body cardio and warm-up exercise that raises heart rate while engaging legs, core, and shoulders.",
      "instructions": [
        "Stand upright with feet together and arms at your sides.",
        "Jump your legs out to about hip or shoulder width while simultaneously raising both arms overhead.",
        "Land softly with knees slightly bent and arms fully extended above you.",
        "Immediately jump your legs back together and lower arms to sides to return to the starting position.",
        "Maintain a steady rhythm, breathing evenly throughout."
      ]
    }
  },
  {
    "e_name": "jumping lunges",
    "e_level": 4,
    "e_body_split": 3,
    "e_youtube_id": "vdXgfYot7Rc",
    "e_description": {
      "about": "Jumping lunges are a powerful plyometric lower-body exercise. They blend strength and cardio by alternating explosive lunges in mid-air, targeting quads, glutes, hamstrings, calves and engaging the core and hip stabilizers to improve balance, agility, coordination and power.",
      "instructions": [
        "Stand with feet shoulder-width apart, core engaged and chest lifted.",
        "Step back with one leg into a lunge so both knees are at roughly 90°.",
        "Explode upward, switching legs mid-air to land in deep lunge on opposite side.",
        "Land softly with front heel down and rear toes on ground, immediately drop into next rep.",
        "Continue alternating at a steady, controlled pace—aim for 6-10 reps.",
        "Keep core tight, spine neutral, and avoid letting your front knee go past toes."
      ]
    }
  },
  {
    "e_name": "jumping pull-ups",
    "e_level": 3,
    "e_body_split": 2,
    "e_youtube_id": "7nHfRFiltcA",
    "e_description": {
      "about": "Jumping pull-ups are a dynamic exercise that combines the benefits of a pull-up with an explosive jump. This movement is particularly effective for building upper body strength, coordination, and overall fitness. By incorporating a jump, you not only engage your back and arm muscles but also recruit your lower body, making it a compound exercise that enhances functional strength.",
      "instructions": [
        "Stand beneath a pull-up bar with your feet shoulder-width apart.",
        "Jump up and grab the bar with an overhand grip, hands slightly wider than shoulder-width apart.",
        "Hang from the bar with your arms fully extended and your feet off the ground.",
        "Engage your core and pull your shoulder blades down and back.",
        "Exhale and pull your body up towards the bar, keeping your elbows close to your body.",
        "Once your chin is above the bar, pause for a moment.",
        "Inhale and slowly lower your body back down to the starting position.",
        "Repeat for the desired number of reps."
      ]
    }
  },
  {
    "e_name": "knee strikes",
    "e_level": 1,
    "e_body_split": 1,
    "e_youtube_id": "mLm_H9SaXJ4",
    "e_description": {
      "about": "Knee strikes are a fundamental movement in martial arts and fitness training, focusing on developing core strength, balance, and coordination. This exercise involves driving the knee upward toward the chest or an elevated target, engaging the hip flexors, quadriceps, and core muscles. It's commonly used in kickboxing, Muay Thai, and self-defense training to improve explosive power and agility.",
      "instructions": [
        "Stand with feet hip-width apart and knees slightly bent.",
        "Engage your core and maintain an upright posture.",
        "Lift your right knee toward your chest, driving through the hip and keeping the left leg stable.",
        "Lower the right leg back to the starting position and repeat with the left knee.",
        "Continue alternating knees in a controlled and rhythmic manner.",
        "Focus on maintaining balance and proper form throughout the movement."
      ]
    }
  },
  {
    "e_name": "L sit pull-ups",
    "e_level": 5,
    "e_body_split": 1,
    "e_youtube_id": "m5rnCuzJqaE",
    "e_description": {
      "about": "L-sit pull-ups are an advanced calisthenics movement that combines the core engagement of an L-sit with the upper-body strength required for a pull-up. This exercise targets the latissimus dorsi, biceps, and core, enhancing muscle coordination and overall body control.",
      "instructions": [
        "Begin by hanging from a pull-up bar with an overhand grip, hands slightly wider than shoulder-width apart.",
        "Engage your core and lift your legs into an L-shape, keeping them parallel to the ground and your thighs at a 90-degree angle to your torso.",
        "Pull your chin above the bar while maintaining the L-sit position.",
        "Slowly lower your body back to the starting position, keeping your legs elevated throughout the movement.",
        "Repeat for the desired number of repetitions."
      ]
    }
  },
  {
    "e_name": "leg raises",
    "e_level": 2,
    "e_body_split": 4,
    "e_youtube_id": "iP-Om5uAYVo",
    "e_description": {
      "about": "Leg raises are a fundamental exercise that targets the lower abdominal muscles, hip flexors, and core. They are performed by lying flat on your back and lifting your legs toward the ceiling while keeping them straight. This movement helps improve core strength, stability, and endurance.",
      "instructions": [
        "Lie flat on your back with your legs extended and arms at your sides or placed under your glutes for support.",
        "Engage your core and slowly lift your legs toward the ceiling, keeping them straight and together.",
        "Pause briefly when your legs are vertical, then slowly lower them back down without letting them touch the floor.",
        "Repeat for the desired number of repetitions, maintaining control throughout the movement."
      ]
    }
  },
  {
    "e_name": "lunges",
    "e_level": 2,
    "e_body_split": 3,
    "e_youtube_id": "7JsXmM2zKoc",
    "e_description": {
      "about": "Lunges are a dynamic, compound exercise that targets multiple lower-body muscles, including the quadriceps, hamstrings, glutes, and calves. They are effective for building strength, improving balance, and enhancing functional movement patterns. Lunges can be performed in various directions—forward, reverse, or lateral—to engage muscles from different angles.",
      "instructions": [
        "Stand upright with your feet hip-width apart.",
        "Take a step forward with your right leg, lowering your hips until both knees are bent at approximately 90 degrees.",
        "Ensure your right knee is directly above your ankle and does not extend past your toes.",
        "Your left knee should hover just above the ground without touching it.",
        "Push through your right heel to return to the starting position.",
        "Repeat the movement with your left leg.",
        "Continue alternating legs for the desired number of repetitions."
      ]
    }
  },
  {
    "e_name": "mountain climbers",
    "e_level": 2,
    "e_body_split": 1,
    "e_youtube_id": "xYvGLOEyn_g",
    "e_description": {
      "about": "Mountain climbers are a high-intensity, bodyweight exercise that engages multiple muscle groups simultaneously, including the core, shoulders, arms, and legs. This dynamic movement mimics the action of climbing a mountain, providing a full-body workout that improves cardiovascular endurance, strength, and coordination.",
      "instructions": [
        "Start in a high plank position with your hands shoulder-width apart and your body forming a straight line from head to heels.",
        "Engage your core to maintain a stable spine and avoid letting your hips sag.",
        "Quickly drive your right knee toward your chest, then return it to the starting position.",
        "Immediately drive your left knee toward your chest, alternating legs in a fluid, running motion.",
        "Continue alternating legs at a brisk pace, keeping your movements controlled and steady."
      ]
    }
  },
  {
    "e_name": "muscle-ups",
    "e_level": 6,
    "e_body_split": 1,
    "e_youtube_id": "gVIDCmHnTJ8",
    "e_description": {
      "about": "A challenging compound exercise combining a pull-up and a dip in one fluid motion. It builds explosive upper-body strength, engaging back, shoulders, arms and core while improving coordination and control.",
      "instructions": [
        "Start in a dead-hang grip slightly wider than shoulder-width.",
        "Pull explosively until your chest approaches the bar.",
        "Rotate wrists and transition into a straight-bar dip when chest is over the bar.",
        "Press down fully to lock out arms until over the bar.",
        "Lower yourself back under control to the dead hang.",
        "Scale with kipping, band-assisted, negative or ring muscle-up variations."
      ]
    }
  },
  {
    "e_name": "open close scissors",
    "e_level": 1,
    "e_body_split": 4,
    "e_youtube_id": "v0_dlmFvnL4",  
    "e_description": {
      "about": "A core-targeting exercise performed lying on your back. Legs are lifted slightly and moved apart and together in a controlled ‘scissor' motion, helping to build lower abdominal and hip flexor strength, while improving hip control and endurance.",
      "instructions": [
        "Lie flat on your back with your legs extended and arms by your sides.",
        "Lift your shoulders and legs a few inches off the floor, engaging the core.",
        "Open your legs apart (like scissors), then close them together.",
        "Keep the movement controlled and continuous—no resting between repetitions.",
        "Maintain core tension and avoid arching the low back."
      ]
    }
  },
  {
    "e_name": "pistol squats",
    "e_level": 5,
    "e_body_split": 3,
    "e_youtube_id": "",
    "e_description": {
      "about": "The pistol squat is a challenging single-leg squat that targets your quads, hamstrings, glutes, and core. It requires excellent balance, stability, and lower-body mobility. Often viewed as a true test of unilateral lower-body strength.",
      "instructions": [
        "Stand tall with feet hip-width apart and shift weight onto one leg.",
        "Extend the opposite leg straight out in front of you, keeping it elevated throughout the movement.",
        "Use your arms extended forward for balance and keep your chest lifted.",
        "Slowly squat down on the standing leg, aiming to bring your hamstring close to your calf while keeping heel grounded.",
        "Pause briefly at the bottom, then drive through your heel and engage your core to return to standing.",
        "Perform all reps on one side before switching legs, and keep the non-working leg level throughout."
      ]
    }
  },
  {
    "e_name": "plank jacks",
    "e_level": 2,
    "e_body_split": 1,
    "e_youtube_id": "",
    "e_description": {
      "about": "Plank jacks are a dynamic bodyweight exercise that merges core-strengthening benefits of a plank with cardiovascular impact of a jumping jack. They primarily engage the abdominals, shoulders, glutes, and legs, boosting stability, coordination, and endurance.",
      "instructions": [
        "Begin in a high plank position: hands directly under shoulders, body forming a straight line from head to heels.",
        "Engage your core and squeeze your glutes to maintain alignment—don't let your hips drop or lift.",
        "Quickly jump both feet out to just beyond shoulder-width, then jump them back together, keeping your torso steady.",
        "Continue jumping in and out in a controlled, rhythmic motion for the desired time or reps.",
        "Maintain even breathing throughout and stop if you feel strain in your lower back or wrists."
      ]
    }
  },
  {
    "e_name": "pull-ups",
    "e_level": 4,
    "e_body_split": 2,
    "e_youtube_id": "W9DKM3tjOkk",
    "e_description": {
      "about": "Pull-ups are a classic upper-body compound movement performed by hanging from a bar and pulling your body upward using an overhand (pronated) grip. They primarily work the latissimus dorsi, biceps, rhomboids, and lower traps, along with the core stabilizers.",
      "instructions": [
        "Grab a bar with hands slightly wider than shoulder-width, palms facing away (overhand grip).",
        "Start from a dead hang with arms fully extended and shoulders engaged.",
        "Pull yourself upward by driving your elbows down and back, aiming to clear your chin above the bar.",
        "Pause briefly at the top with your chest tall and shoulders down.",
        "Lower yourself in a controlled manner until your arms are straight to complete one rep.",
        "Keep your core tight and avoid swinging or kipping during the descent."
      ]
    }
  },
  {
    "e_name": "push-ups",
    "e_level": 3,
    "e_body_split": 2,
    "e_youtube_id": "Dy8WNMPDj5Y",
    "e_description": {
      "about": "A classic bodyweight exercise that builds upper-body strength—main targets include chest (pectorals), shoulders (anterior deltoids), triceps, and core stabilizers. This tutorial emphasizes proper alignment, controlled movement, and full range of motion to reduce risk of injury and maximize strength gains.",
      "instructions": [
        "Start in a high plank position with hands just outside shoulder-width and body in a straight line from head to heels.",
        "Lower your chest toward the floor by bending elbows at a roughly 45° angle, keeping your core tight and hips level.",
        "Pause just above the ground, then push back up through your palms to full arm extension.",
        "Maintain a neutral spine throughout—avoid sagging hips or piking your butt.",
        "Progress by beginning on knees or wall if needed, progressing gradually to a full push-up."
      ]
    }
  },
  {
    "e_name": "rolling sit-ups",
    "e_level": 1,
    "e_body_split": 4,
    "e_youtube_id": "Exh-xo2Plbs",
    "e_description": {
      "about": "Rolling sit-ups are a dynamic variation of the traditional sit-up that target the entire core, especially the rectus abdominis and hip flexors. The rolling motion helps improve coordination, engages stabilizer muscles, and adds a slight cardio element to the movement. It's a great bodyweight core exercise suitable for beginners looking to build core strength in a more fluid, full-body motion.",
      "instructions": [
        "Sit on the floor with your knees bent and feet flat on the ground.",
        "Extend your arms forward and tuck your chin slightly.",
        "Roll back onto your spine, allowing your back to touch the ground smoothly.",
        "Use momentum and your core muscles to roll back up to a seated position.",
        "Try to keep your feet planted and avoid jerky motions.",
        "Repeat the movement fluidly for the desired number of repetitions."
      ]
    }
  },
  {
    "e_name": "seated dips",
    "e_level": 3,
    "e_body_split": 2,
    "e_youtube_id": "ovVHOfT35eo",
    "e_description": {
      "about": "Seated dips are a machine-based exercise that primarily targets the triceps while engaging the chest and shoulders. By pressing handles downward from a seated position with arms fully extended, you build upper-body pushing strength without bearing your full body weight.",
      "instructions": [
        "Adjust the seat so that the handles are approximately at chest level.",
        "Sit upright against the pad, feet flat on the floor, and maintain a straight back.",
        "Grip the handles with a neutral (palms inward) grip, elbows close to your sides.",
        "Lower yourself by bending at the elbows until they reach about a 90° angle.",
        "Pause briefly at the bottom, then push back up to near-full arm extension without locking out.",
        "Keep core engaged and body aligned throughout the movement to avoid momentum.",
        "Exhale as you press down, inhale as you return to start."
      ]
    }
  },
  {
    "e_name": "shoot-ups",
    "e_level": 2,
    "e_body_split": 4,
    "e_youtube_id": "s7f7alfiuU8",
    "e_description": {
      "about": "Shoot-Ups are a dynamic core exercise that targets the abdominal muscles, particularly the rectus abdominis and hip flexors. This movement involves a controlled leg raise combined with an explosive upward thrust, engaging multiple muscle groups for improved strength and coordination.",
      "instructions": [
        "Begin by sitting on the floor with your legs extended straight in front of you.",
        "Place your hands on the floor beside your hips for support.",
        "Engage your core and raise your legs toward your chest.",
        "As your legs approach your chest, simultaneously thrust your upper body upward, aiming to bring your chest toward your knees.",
        "Reverse the movement, lowering your legs and torso back to the starting position.",
        "Repeat for the desired number of repetitions, maintaining control and avoiding swinging."
      ]
    }
  },
  {
    "e_name": "side crunches",
    "e_level": 1,
    "e_body_split": 4,
    "e_youtube_id": "PO5yfLjUDbE",
    "e_description": {
      "about": "Side crunches (also called oblique crunches) are a variation of the standard crunch that target the oblique muscles along your side waist. This isolation core exercise strengthens the external and internal obliques along with the rectus abdominis, helping to improve core stability and torso definition.",
      "instructions": [
        "Lie on your side with knees bent and stacked, feet on the floor.",
        "Place your lower arm on the floor for support and upper hand gently behind your head.",
        "Keep your head neutral, chin angled slightly down.",
        "Squeeze your obliques and lift your torso upward—elbow moves toward hip.",
        "Pause 1-2 seconds at the top feeling the contraction.",
        "Lower back down with control moving only your torso.",
        "Complete desired reps, then switch sides and repeat."
      ]
    }
  },
  {
    "e_name": "side-to-side hops",
    "e_level": 1,
    "e_body_split": 3,
    "e_youtube_id": "ujj6IuL3zOM",
    "e_description": {
      "about": "Side-to-side hops are a beginner-level plyometric exercise that improves cardiovascular fitness while working your quads, glutes, calves, and improving lateral agility and coordination.",
      "instructions": [
        "Stand with feet hip-width apart, knees slightly bent, core engaged.",
        "Bend hips slightly, stay light on the balls of your feet.",
        "Explosively hop laterally to the right, landing softly on both feet.",
        "Immediately push off and hop back to the left side.",
        "Continue alternating sides in a steady rhythm for desired reps or time."
      ]
    }
  },
  {
    "e_name": "side-to-side pull-ups",
    "e_level": 5,
    "e_body_split": 2,
    "e_youtube_id": "55fd5RV4JV4",
    "e_description": {
      "about": "An explosive upper-body pull-up variation where you shift laterally on the bar each rep. This engages the lats, biceps, shoulders, obliques, and core to stabilize the torso while pulling side-to-side.",
      "instructions": [
        "Grip the pull-up bar with palms facing away, shoulder-width apart.",
        "Hang in a dead-hang position with core tight.",
        "Pull your body up toward your left hand so your left pec nears the bar.",
        "Lower down in a controlled motion, then pull toward the right hand on the next rep.",
        "Continue alternating sides while keeping your torso steady and core engaged."
      ]
    }
  },
  {
    "e_name": "single-arm push-ups",
    "e_level": 6,
    "e_body_split": 2,
    "e_youtube_id": "U73FFFpin8s",
    "e_description": {
      "about": "A highly advanced unilateral upper-body exercise, the single-arm push-up challenges shoulder, chest, triceps, and core strength while demanding exceptional balance and control.",
      "instructions": [
        "Begin in a standard high-plank push-up position, feet wider to increase stability.",
        "Shift your weight onto one arm and the opposite foot, keeping the torso stable and core engaged.",
        "Lower your body slowly toward the ground, keeping the elbow tucked in at a 45-degree angle.",
        "Press back up through the supporting arm, maintaining a straight body line.",
        "Repeat for desired reps, then switch sides and repeat."
      ]
    }
  },
  {
    "e_name": "sit-ups",
    "e_level": 3,
    "e_body_split": 4,
    "e_youtube_id": "TjxDtCzJQkg",
    "e_description": {
      "about": "Sit-ups are a classic core exercise that engage the full range of the abdominal muscles—including the rectus abdominis, obliques, and hip flexors—to lift your torso from a lying to a seated position. When performed with control and proper form, they help build core strength and improve posture.",
      "instructions": [
        "Lie on your back with knees bent and feet flat on the floor, about hip-width apart.",
        "Place your hands lightly on your temples or keep arms crossed on your chest.",
        "Engage your core, keeping your neck neutral—not pulling with your hands.",
        "Exhale and curl your torso up until it’s nearly vertical, lifting chest toward knees.",
        "Hold for a moment at the top, then inhale and slowly lower back down with control.",
        "Repeat for the desired number of reps, avoiding momentum and guiding the movement with your core."
      ]
    }
  },
  {
    "e_name": "spiderman push-ups",
    "e_level": 4,
    "e_body_split": 2,
    "e_youtube_id": "f29xFGVjKA8",
    "e_description": {
      "about": "Spiderman push-ups are an advanced variation of the standard push-up that combine upper body strength with core stability and hip mobility. This exercise involves bringing one knee toward the elbow during the descent, mimicking the movement of climbing a wall, thereby engaging the chest, shoulders, triceps, core, and hip flexors.",
      "instructions": [
        "Begin in a high plank position with hands slightly wider than shoulder-width apart and feet hip-width apart.",
        "As you lower your body toward the floor, bring your right knee toward your right elbow, keeping your hips level and core engaged.",
        "Push back up to the starting position, returning your right leg to the starting position.",
        "Repeat the movement on the left side, bringing your left knee toward your left elbow during the next push-up.",
        "Continue alternating sides for the desired number of reps, maintaining a steady rhythm and proper form throughout."
      ]
    }
  },
  {
    "e_name": "squat jumps",
    "e_level": 3,
    "e_body_split": 3,
    "e_youtube_id": "i3gcPC0Tm0c",
    "e_description": {
      "about": "Squat jumps are a high-intensity, plyometric lower-body exercise that develops explosive power and strength in the legs, glutes, and core. As a progression of the bodyweight squat, the jump phase forces rapid muscle activation and helps improve vertical lift, coordination, and cardiovascular endurance:contentReference[oaicite:0]{index=0}.",
    "instructions": [
      "Stand with feet shoulder-width apart, toes angled slightly outward, arms at sides or front for balance.",
      "Brace your core and lower into a controlled squat, bending hips and knees until thighs are almost parallel to the floor.",
      "From the bottom of the squat, swing arms back and then forcefully drive through your whole foot to jump straight up as explosively as possible.",
      "Land softly on the balls of your feet and then immediately shift weight back to your heels while absorbing impact with bent knees.",
      "Reset your posture and repeat. Aim for full height each rep rather than rushing.",
      "Keep your knees tracking over your toes and your chest lifted throughout the motion.",
      "Use this move sparingly—1-2 times/week—to minimize joint impact and allow recovery for the joints and connective tissue:contentReference[oaicite:1]{index=1}."
    ]
    }
  },
  {
    "e_name": "tuck jumps",
    "e_level": 4,
    "e_body_split": 2,
    "e_youtube_id": "XwOHycBa3uY",  
    "e_description": {
      "about": "Tuck jumps are a high-intensity plyometric exercise that builds explosive lower-body power, strength, coordination, and cardiovascular endurance. They target the quadriceps, hamstrings, glutes, hip flexors, calves, and core while challenging landing control and full-body stability.",
      "instructions": [
        "Stand with your feet hip-width apart, knees slightly bent, core braced, and arms relaxed by your sides.",
        "Drop quickly into a quarter-squat by hinging at the hips and bending your knees slightly, preparing to jump.",
        "Explode upward, driving through the balls of your feet and swinging your arms for momentum.",
        "At the peak of the jump, tuck your knees toward your chest and attempt to bring them as close as possible.",
        "Land softly on the balls of your feet, immediately absorbing shock through bent knees and hips.",
        "Reset by returning to the quarter-squat and immediately repeat for the desired reps, maintaining rhythm and control."
      ]
    }
  },
  {
    "e_name": "up down scissors",
    "e_level": 1,
    "e_body_split": 4,
    "e_youtube_id": "P2FRHzgYbuo",
    "e_description": {
      "about": "A dynamic Pilates-style core exercise targeting the lower abdominals, hip flexors and transverse abdominis. It strengthens core stability while engaging the legs in controlled vertical scissoring motions.",
      "instructions": [
        "Lie face up on a mat with arms beside your body or hands lightly supporting your glutes to protect the lower back.",
        "Lift both legs a few inches off the ground, keeping them straight or with a slight bend in the knees for comfort.",
        "Begin the scissor motion by slowly lowering one leg toward the floor while raising the other leg upward.",
        "Switch legs in a controlled manner without letting either foot touch the floor.",
        "Continue alternating legs at a slow, rhythmic pace. Maintain core tension and keep your lower back pressed into the mat.",
        "Start with 10-15 switches per side or perform for 30 seconds, rest briefly, and repeat for 2-3 sets."
      ]
    }
  },
  {
    "e_name": "wipers",
    "e_level": 4,
    "e_body_split": 4,
    "e_youtube_id": "4YedNMNlI80",
    "e_description": {
      "about": "The floor wipers (lying windshield wipers) target your obliques and deep core. Lying on your back, you rotate both legs side-to-side in a controlled ‘wiper' motion while keeping your shoulders grounded. This builds rotational core strength, hip stability, and helps improve spinal mobility.",
      "instructions": [
        "Lie on your back with arms outstretched horizontally for support.",
        "Lift legs straight up toward the ceiling so they're perpendicular to your torso.",
        "Engage your core and slowly lower both legs to one side as far as you can while keeping shoulders flat.",
        "Pause briefly, then lift back to center and repeat on the opposite side.",
        "Continue rotating legs side-to-side in a smooth, controlled motion, breathing steadily.",
        "Keep lower back pressed lightly on the floor and move only through core control, not swinging the hips."
      ]
    }
  },
  {
    "e_name": "small arm circles",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Small arm circles are a dynamic warm-up movement designed to gently activate the shoulders, deltoids, and upper back. By performing small forward circular motions, this exercise helps improve joint mobility, blood flow, and range of motion in the shoulder girdle.",
      "instructions": [
        "Stand upright with your feet shoulder-width apart and extend your arms straight out to your sides at shoulder height.",
        "Keep your arms straight and begin making small forward circular motions with your hands.",
        "Maintain controlled movement and avoid shrugging your shoulders.",
        "Continue the motion for 20-30 seconds or 15-20 circles.",
        "Repeat for 2-3 sets as part of your warm-up routine."
      ]
    }
  },
  {
    "e_name": "reverse small arm circles",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Reverse small arm circles target the same shoulder and upper back muscles as the forward variation but emphasize the rear deltoids and shoulder retraction more. They help increase shoulder flexibility and muscular endurance in a safe and low-impact way.",
      "instructions": [
        "Stand with arms extended straight out to the sides at shoulder height.",
        "Begin making small backward circular motions with your hands, keeping your arms fully extended and steady.",
        "Engage your core and maintain an upright posture throughout the movement.",
        "Perform the circles for 20-30 seconds or 15-20 reps.",
        "Repeat for 2-3 sets or alternate with forward circles for a balanced warm-up."
      ]
    }
  },
  {
    "e_name": "large arm circles",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Large arm circles are a dynamic mobility drill that increases flexibility in the shoulders and upper arms while activating the chest and back muscles. The larger range of motion promotes joint lubrication and prepares the body for upper-body workouts or sports activities.",
      "instructions": [
        "Stand tall with your arms extended out to your sides at shoulder height.",
        "Begin making large forward circular motions with your arms, gradually increasing the range of motion without straining.",
        "Ensure your arms stay relatively straight and avoid arching your back.",
        "Perform 10-15 large circles forward in a smooth and controlled manner.",
        "Repeat for 2-3 sets, resting briefly between rounds if needed."
      ]
    }
  },
  {
    "e_name": "reverse large arm circles",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Reverse large arm circles help improve shoulder stability, scapular mobility, and posture. Rotating the arms backward in a wide arc targets the posterior deltoids and upper back, making this stretch a valuable warm-up or active recovery drill.",
      "instructions": [
        "Stand with your feet hip-width apart and arms extended at shoulder height.",
        "Make large backward circular motions with your arms, keeping them straight and controlled.",
        "Focus on a full, smooth range of motion without flaring your ribs or shrugging your shoulders.",
        "Complete 10-15 repetitions in reverse, breathing steadily as you move.",
        "Repeat for 2-3 sets or alternate with the forward version for optimal shoulder prep."
      ]
    }
  },
  {
    "e_name": "lateral arm raises",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Lateral arm raises are a gentle shoulder mobility exercise that targets the lateral deltoids and upper trapezius muscles. This stretch helps improve shoulder flexibility and posture, making it a great warm-up movement before upper-body workouts or sports requiring arm movement.",
      "instructions": [
        "Stand upright with your feet shoulder-width apart and arms relaxed at your sides.",
        "Slowly raise your arms out to the sides until they reach shoulder height, forming a 'T' shape with your body.",
        "Pause briefly at the top, keeping your arms parallel to the ground and your palms facing down.",
        "Lower your arms back to your sides in a controlled motion.",
        "Repeat for 10-15 repetitions, maintaining a steady breathing rhythm throughout the movement."
      ]
    }
  },
  {
    "e_name": "front arm raises",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Front arm raises are a dynamic stretch that primarily activates the front deltoid muscles while also engaging the upper chest and shoulders. This movement improves anterior shoulder mobility and is ideal for warming up before pressing or overhead movements.",
      "instructions": [
        "Stand tall with your arms relaxed at your sides and your palms facing your thighs.",
        "Raise both arms straight in front of you to shoulder height, keeping them parallel and extended.",
        "Pause briefly at the top with your palms facing down and arms aligned with your shoulders.",
        "Lower your arms back down slowly and with control.",
        "Perform 10-15 repetitions, focusing on smooth, steady motion and upright posture."
      ]
    }
  },
  {
    "e_name": "lateral rotator cuffs",
    "e_level": 1,
    "e_body_split": 1,
    "e_youtube_id": "",
    "e_description": {
      "about": "The lateral rotator cuff stretch is designed to gently improve external rotation and shoulder joint mobility, particularly targeting the infraspinatus and teres minor muscles. This stretch helps maintain healthy shoulder function and can support injury prevention during overhead or throwing activities.",
      "instructions": [
        "Stand upright with feet shoulder-width apart.",
        "Extend one arm out to the side at shoulder height, then bend the elbow 90 degrees so your forearm points downward and your palm faces the floor.",
        "While keeping your upper arm stable, slowly rotate your forearm upward until your palm is facing forward.",
        "Hold the rotated position for 5-10 seconds, feeling a stretch through your shoulder.",
        "Return to the starting position with control.",
        "Repeat for 8-12 repetitions on each side."
      ]
    }
  },
  {
    "e_name": "front rotator cuffs",
    "e_level": 1,
    "e_body_split": 1,
    "e_youtube_id": "",
    "e_description": {
      "about": "The front rotator cuff stretch is a mobility exercise that targets the subscapularis and other rotator cuff muscles responsible for internal and external shoulder rotation. By practicing this stretch with the arm positioned in front of the body, it emphasizes anterior mobility and can aid in reducing shoulder tightness.",
      "instructions": [
        "Stand upright with your arm extended straight in front of you at shoulder height.",
        "Bend your elbow 90 degrees so your forearm points downward and your palm faces the floor.",
        "While keeping your upper arm stable, rotate your forearm upward until your palm faces forward.",
        "Hold the stretch for 5-10 seconds, focusing on the controlled rotation in the shoulder joint.",
        "Slowly return to the starting position.",
        "Perform 8-12 repetitions per side, switching arms after completing the set."
      ]
    }
  },
  {
    "e_name": "low arm criss crosses",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Low arm criss crosses are a variation of the classic arm criss cross stretch, focusing more on the lower pectoral and front deltoid muscles. It encourages gentle mobility in the shoulders and chest while maintaining a slightly lower arm angle.",
      "instructions": [
        "Stand upright with arms extended downward at about a 45-degree angle from your sides.",
        "Swing both arms inward so they cross low in front of your hips.",
        "Return the arms outward with control to the starting position.",
        "Alternate which arm is on top each time you cross.",
        "Perform the movement rhythmically for 30-60 seconds."
      ]
    }
  },
  {
    "e_name": "arm criss crosses",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "The arm criss cross stretch targets the chest, shoulders, and upper back by dynamically opening and closing the arms across the centerline of the body. This movement helps warm up the upper body and improves shoulder mobility and circulation.",
      "instructions": [
        "Stand upright with feet shoulder-width apart and arms extended out to the sides at shoulder height.",
        "Swing your arms inward across your chest so they crisscross in front of your body.",
        "Open your arms back out to the sides with control.",
        "Alternate which arm crosses on top each time.",
        "Repeat the motion continuously for 30-60 seconds while maintaining a steady rhythm."
      ]
    }
  },
  {
    "e_name": "high arm criss crosses",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "High arm criss crosses are a dynamic stretch that targets the upper chest, shoulders, and upper traps. Performing the motion at head level or above increases shoulder range of motion and promotes flexibility in the upper thoracic region.",
      "instructions": [
        "Stand with arms raised just above shoulder level, extended outward to the sides.",
        "Swing your arms inward so they crisscross in front of your face or forehead.",
        "Open the arms back out with control.",
        "Alternate the top arm with each repetition.",
        "Continue for 30-60 seconds, keeping a light and steady motion."
      ]
    }
  },
  {
    "e_name": "running arm swings",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Running arm swings simulate the natural motion of the arms during a running stride. This dynamic stretch helps warm up the shoulders, upper back, and arms, promoting coordination and range of motion before cardio or full-body workouts.",
      "instructions": [
        "Stand tall with feet hip-width apart and arms relaxed at your sides.",
        "Begin swinging one arm forward and the opposite arm backward, mimicking a running motion.",
        "Keep elbows slightly bent and swing naturally from the shoulders.",
        "Alternate arms in a rhythmic and controlled manner.",
        "Continue the motion for 30-60 seconds, gradually increasing speed if desired."
      ]
    }
  },
  {
    "e_name": "neck up-downs",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Neck up-downs are a gentle and effective stretch that target the front and back of the neck. This exercise helps reduce stiffness, increase cervical mobility, and relieve tension caused by prolonged sitting or poor posture.",
      "instructions": [
        "Sit or stand tall with your shoulders relaxed and back straight.",
        "Slowly lower your chin toward your chest, feeling a stretch in the back of your neck.",
        "Hold for 3-5 seconds.",
        "Gently tilt your head back to look upward, stretching the front of your neck.",
        "Hold for 3-5 seconds.",
        "Return to the starting position.",
        "Repeat for 8-10 controlled repetitions."
      ]
    }
  },
  {
    "e_name": "neck side-to-sides",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Neck side-to-side stretches help release tension in the sides of the neck and improve flexibility in the cervical spine. This movement is especially beneficial for people experiencing tightness from desk work or poor sleeping posture.",
      "instructions": [
        "Sit or stand in a relaxed, upright position.",
        "Turn your head slowly to the right until you feel a gentle stretch along the side of your neck.",
        "Hold for 3-5 seconds.",
        "Return to center, then turn your head to the left.",
        "Hold for another 3-5 seconds.",
        "Repeat the motion 8-10 times on each side."
      ]
    }
  },
  {
    "e_name": "neck leans",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Neck leans stretch the muscles on the side of the neck and upper shoulders. This movement helps alleviate stiffness and improve the range of motion, making it ideal for warming up or cooling down.",
      "instructions": [
        "Sit or stand upright with a neutral spine and relaxed shoulders.",
        "Slowly tilt your head to the right, bringing your ear toward your shoulder without lifting the shoulder.",
        "Hold for 5 seconds while feeling a stretch on the left side of your neck.",
        "Return to center and repeat on the left side.",
        "Hold again for 5 seconds.",
        "Repeat 8-10 times per side."
      ]
    }
  },
  {
    "e_name": "neck rotations",
    "e_level": 1,
    "e_body_split": 2,
    "e_youtube_id": "",
    "e_description": {
      "about": "Neck rotations improve mobility and flexibility in the cervical spine by gently rotating the head through its range of motion. This stretch helps relieve muscle tightness and is useful for desk workers or those with limited head-turning mobility.",
      "instructions": [
        "Sit or stand with a tall posture and shoulders relaxed.",
        "Slowly rotate your head to the right, keeping your chin level and aligned with your neck.",
        "Hold for 3-5 seconds, feeling a stretch along the opposite side.",
        "Return to the center, then rotate to the left.",
        "Hold for 3-5 seconds.",
        "Repeat for 8-10 repetitions on each side."
      ]
    }
  },
  {
    "e_name": "heel-to-glutes",
    "e_level": 2,
    "e_body_split": 3,
    "e_youtube_id": "",
    "e_description": {
      "about": "Heel-to-glutes is a dynamic stretch that targets the quadriceps and helps improve knee flexion. It's commonly used in warm-ups to prepare the lower body for running or explosive movement.",
      "instructions": [
        "Stand tall with feet hip-width apart.",
        "Lift your right heel toward your glute by bending your knee.",
        "Grab your right ankle with your right hand to gently increase the stretch.",
        "Keep your knees close together and your back straight.",
        "Hold for 2-3 seconds, then release.",
        "Repeat on the left side.",
        "Continue alternating legs for 8-10 reps per side."
      ]
    }
  },
  {
    "e_name": "knee hugs",
    "e_level": 2,
    "e_body_split": 1,
    "e_youtube_id": "",
    "e_description": {
      "about": "Knee hugs stretch the glutes, lower back, and hips. This movement helps improve hip mobility and balance, making it ideal for warming up before running or lower-body workouts.",
      "instructions": [
        "Stand upright with feet shoulder-width apart.",
        "Lift your right knee toward your chest.",
        "Wrap both hands around your shin and gently pull your knee in close.",
        "Hold the stretch for 2-3 seconds while standing tall.",
        "Lower your leg and repeat on the opposite side.",
        "Alternate legs for 8-10 reps per side."
      ]
    }
  },
  {
    "e_name": "ankle hugs",
    "e_level": 2,
    "e_body_split": 1,
    "e_youtube_id": "",
    "e_description": {
      "about": "Ankle hugs are a compound stretch that targets the hamstrings, calves, and glutes. The movement involves bending at the waist and pulling the ankle toward the torso, encouraging flexibility and balance.",
      "instructions": [
        "Stand tall with feet hip-width apart.",
        "Lift your right leg straight in front of you while keeping it extended.",
        "Reach forward with both hands and gently hug your ankle or shin, maintaining balance.",
        "Hold the position for 2-3 seconds, feeling a stretch in the back of your leg.",
        "Lower the leg and repeat on the other side.",
        "Perform 8-10 repetitions on each leg."
      ]
    }
  },
  {
    "e_name": "toe touches",
    "e_level": 2,
    "e_body_split": 3,
    "e_youtube_id": "",
    "e_description": {
      "about": "Toe touches stretch the hamstrings, calves, and lower back. This static stretch is great for improving flexibility and relieving tightness in the posterior chain.",
      "instructions": [
        "Stand with feet hip-width apart and knees slightly bent or straight depending on flexibility.",
        "Slowly bend at the waist and reach down toward your toes.",
        "Allow your arms to hang or try to touch your toes with your fingertips.",
        "Hold the stretch for 15-30 seconds while breathing deeply.",
        "Return to the starting position slowly.",
        "Repeat 2-3 times."
      ]
    }
  },
  {
    "e_name": "lateral leg swings",
    "e_level": 2,
    "e_body_split": 3,
    "e_youtube_id": "",
    "e_description": {
      "about": "Lateral leg swings are a dynamic stretch that target the inner and outer thighs, hips, and glutes. This movement helps improve hip mobility and flexibility, making it ideal for warm-ups before running or agility drills.",
      "instructions": [
        "Stand next to a wall or sturdy surface for balance.",
        "Shift your weight onto your left leg and swing your right leg side-to-side in front of your body.",
        "Keep your torso upright and your core engaged throughout the movement.",
        "Swing the leg gently at first, increasing the range of motion as you loosen up.",
        "Perform 10-15 swings, then switch legs."
      ]
    }
  },
  {
    "e_name": "front leg swings",
    "e_level": 2,
    "e_body_split": 3,
    "e_youtube_id": "",
    "e_description": {
      "about": "Front leg swings are used to dynamically stretch the hamstrings, hip flexors, and quadriceps. They enhance lower-body mobility and are commonly used in pre-run warm-ups.",
      "instructions": [
        "Stand tall next to a wall or post for support.",
        "Swing your right leg forward and backward in a controlled motion.",
        "Keep your leg straight and your core engaged.",
        "Avoid arching your back or swinging too forcefully.",
        "Perform 10-15 swings, then switch to the other leg."
      ]
    }
  },
  {
    "e_name": "high hurdles",
    "e_level": 2,
    "e_body_split": 3,
    "e_youtube_id": "",
    "e_description": {
      "about": "High hurdles are a mobility drill designed to mimic the movement of stepping over a high barrier. This stretch targets the hips, hip flexors, and glutes, and helps improve dynamic flexibility and coordination.",
      "instructions": [
        "Stand tall with feet hip-width apart.",
        "Lift your right knee high in front of you.",
        "Rotate your hip outward and step your leg over an imaginary hurdle to the side.",
        "Plant your foot and repeat with the left leg.",
        "Perform 8-10 reps per side in a controlled motion."
      ]
    }
  },
  {
    "e_name": "reverse high hurdles",
    "e_level": 2,
    "e_body_split": 3,
    "e_youtube_id": "",
    "e_description": {
      "about": "Reverse high hurdles target the same muscle groups as high hurdles but in the reverse direction, enhancing balance, coordination, and hip joint mobility.",
      "instructions": [
        "Stand tall with feet hip-width apart.",
        "Lift your right knee out to the side as if finishing a hurdle movement.",
        "Rotate your leg inward and bring it down in front of your body.",
        "Plant your foot and repeat with the left leg.",
        "Perform 8-10 controlled reps per side."
      ]
    }
  }
]